RT-Thread/rt-thread/bsp/nxp/mcx/mcxa/Libraries/MCXA156/MCXA156/drivers/fsl_spc.h
    base->DCDC_BURST_CFG |= SPC_DCDC_BURST_CFG_BURST_REQ_MASK;
}

/*!
 * @brief Check if burst acknowlege flag is asserted.
 *
 * @param base SPC peripheral base address.
 *
 * @retval false DCDC burst not complete.
 * @retval true DCDC burst complete.
 */
static inline bool SPC_CheckDCDCBurstAck(SPC_Type *base)
{
    return ((base->DCDC_BURST_CFG & SPC_DCDC_BURST_CFG_BURST_ACK_MASK) != 0UL);
}

/*!
 * @brief Clear DCDC busrt acknowledge flag.
 *
 * @param base SPC periphral base address.
 */
static inline void SPC_ClearDCDCBurstAckFlag(SPC_Type *base)
{
    base->DCDC_BURST_CFG |= SPC_DCDC_BURST_CFG_BURST_ACK_MASK;
}

/*!
 * @brief Set the count value of the reference clock to configure the period of DCDC not active.
 *
 * @note This function is only useful when DCDC's drive strength is set as pulse refresh.
 * @note The pulse duration(time between on and off) is: reference clock period * (count + 2).
 *
 * @param base SPC peripheral base address.
 * @param count The count value, 16 bit width.
 */
void SPC_SetDCDCRefreshCount(SPC_Type *base, uint16_t count);

#if (defined(FSL_FEATURE_MCX_SPC_HAS_DCDC_CFG_BLEED_EN) && FSL_FEATURE_MCX_SPC_HAS_DCDC_CFG_BLEED_EN)
/*!
 * @brief Enable a bleed resistor to discharge DCDC output when DCDC is disabled.
 *
 * @param base SPC peripheral base address.
 * @param enable Used to enable/disable bleed resistor.
 */
static inline void SPC_EnableDCDCBleedResistor(SPC_Type *base, bool enable)
{
    if (enable)
    {
        base->DCDC_CFG |= SPC_DCDC_CFG_BLEED_EN_MASK;
    }
    else
    {
        base->DCDC_CFG &= ~SPC_DCDC_CFG_BLEED_EN_MASK;
    }
}
#endif /* FSL_FEATURE_MCX_SPC_HAS_DCDC_CFG_BLEED_EN */

/*!
 * @brief Configs DCDC_CORE Regulator in Active mode.
 *
 * @note When changing the DCDC output voltage level, take care to change the CORE LDO voltage level.
 *
 * @param base SPC peripheral base address.
 * @param option Pointer to the spc_active_mode_dcdc_option_t structure.
 *
 * @retval #kStatus_Success Config DCDC regulator in Active power mode successful.
 * @retval #kStatus_SPC_Busy The SPC instance is busy to execute any type of power mode transition.
 * @retval #kStatus_SPC_BandgapModeWrong Set DCDC_CORE Regulator drive strength to Normal, the Bandgap must be enabled.
 */
status_t SPC_SetActiveModeDCDCRegulatorConfig(SPC_Type *base, const spc_active_mode_dcdc_option_t *option);

/*!
 * @brief Set DCDC_CORE Regulator voltage level in Active mode.
 *
 * @note When changing the DCDC output voltage level, take care to change the CORE LDO voltage level.
 *
 * @param base SPC peripheral base address.
 * @param voltageLevel Specify the DCDC_CORE Regulator voltage level, please refer to @ref spc_dcdc_voltage_level_t.
 */
static inline void SPC_SetActiveModeDCDCRegulatorVoltageLevel(SPC_Type *base, spc_dcdc_voltage_level_t voltageLevel)
{
    base->ACTIVE_CFG =
        (base->ACTIVE_CFG & (~SPC_ACTIVE_CFG_DCDC_VDD_LVL_MASK)) | SPC_ACTIVE_CFG_DCDC_VDD_LVL(voltageLevel);
}

/*!
 * @brief Get DCDC_CORE Regulator voltage level in Active mode.
 *
 * @param base SPC peripheral base address.
 * @return DCDC_CORE Regulator voltage level, please refer to @ref spc_dcdc_voltage_level_t.
 */
static inline spc_dcdc_voltage_level_t SPC_GetActiveModeDCDCRegulatorVoltageLevel(SPC_Type *base)
{
    return (spc_dcdc_voltage_level_t)((uint32_t)((base->ACTIVE_CFG & SPC_ACTIVE_CFG_DCDC_VDD_LVL_MASK) >>
                                                 SPC_ACTIVE_CFG_DCDC_VDD_LVL_SHIFT));
}

/*!
 * @brief Set DCDC_CORE Regulator drive strength in Active mode.
 *
 * @note To set DCDC drive strength as Normal, the bandgap must be enabled.
 *
 * @param base SPC peripheral base address.
 * @param driveStrength Specify the DCDC_CORE regulator drive strength, please refer to @ref spc_dcdc_drive_strength_t.
 *
 * @retval #kStatus_Success Set DCDC_CORE Regulator drive strength in Active mode successfully.
 * @retval #kStatus_SPC_BandgapModeWrong Set DCDC_CORE Regulator drive strength to Normal, the Bandgap must be enabled.
 */
status_t SPC_SetActiveModeDCDCRegulatorDriveStrength(SPC_Type *base, spc_dcdc_drive_strength_t driveStrength);

/*!
 * @brief Get DCDC_CORE Regulator drive strength in Active mode.
 *
 * @param base SPC peripheral base address.
 * @return DCDC_CORE Regulator drive strength, please refer to @ref spc_dcdc_drive_strength_t.
 */
static inline spc_dcdc_drive_strength_t SPC_GetActiveModeDCDCRegulatorDriveStrength(SPC_Type *base)
{
    return (spc_dcdc_drive_strength_t)((uint32_t)((base->ACTIVE_CFG & SPC_ACTIVE_CFG_DCDC_VDD_DS_MASK) >>
                                                  SPC_ACTIVE_CFG_DCDC_VDD_DS_SHIFT));
}

/*!
 * @brief Configs DCDC_CORE Regulator in Low power modes.
 *
 * @note If DCDC_CORE Drive Strength is set to Normal, the Bandgap mode in Low Power mode must be programmed
 * to a value that enables the Bandgap.
 * @note In Deep Power Down mode, DCDC regulator is always turned off.
 *
 * @param base SPC peripheral base address.
 * @param option Pointer to the spc_lowpower_mode_dcdc_option_t structure.
 *
 * @retval #kStatus_Success Config DCDC regulator in low power mode successfully.
 * @retval #kStatus_SPC_Busy The SPC instance is busy to execute any type of power mode transition.
 * @retval #kStatus_SPC_BandgapModeWrong The bandgap mode setting in Low Power mode is wrong.
 */
status_t SPC_SetLowPowerModeDCDCRegulatorConfig(SPC_Type *base, const spc_lowpower_mode_dcdc_option_t *option);

/*!
 * @brief Set DCDC_CORE Regulator drive strength in Low power mode.
 *
 * @note To set drive strength as normal, the bandgap must be enabled.
 *
 * @param base SPC peripheral base address.
 * @param driveStrength Specify the DCDC_CORE Regulator drive strength, please refer to @ref spc_dcdc_drive_strength_t.
 *
 * @retval #kStatus_Success Set DCDC_CORE Regulator drive strength in Low power mode successfully.
 * @retval #kStatus_SPC_BandgapModeWrong Set DCDC_CORE Regulator drive strength to Normal, the Bandgap must be enabled.
 */
status_t SPC_SetLowPowerModeDCDCRegulatorDriveStrength(SPC_Type *base, spc_dcdc_drive_strength_t driveStrength);

/*!
 * @brief Get DCDC_CORE Regulator drive strength in Low power mode.
 *
 * @param base SPC peripheral base address.
 * @return DCDC_CORE Regulator drive strength, please refer to @ref spc_dcdc_drive_strength_t.
 */
static inline spc_dcdc_drive_strength_t SPC_GetLowPowerModeDCDCRegulatorDriveStrength(SPC_Type *base)
{
    return (spc_dcdc_drive_strength_t)((uint32_t)((base->LP_CFG & SPC_LP_CFG_DCDC_VDD_DS_MASK) >>
                                                  SPC_LP_CFG_DCDC_VDD_DS_SHIFT));
}

/*!
 * @brief Set DCDC_CORE Regulator voltage level in Low power mode.
 *
 * @note To change DCDC level in Low-Power mode:
 *          1. Configure LP_CFG[DCDC_VDD_LVL] to desired level;
 *          2. Configure LP_CFG[DCDC_VDD_DS] to low driver strength;
 *  	    3. Configure ACTIVE_CFG[DCDC_VDD_LVL] to same level programmed in #1.
 *
 * @note After invoking this function, the voltage level in active mode(wakeup from low power modes) also changed,
 * if it is necessary, please invoke SPC_SetActiveModeDCDCRegulatorVoltageLevel() to change to desried voltage level.
 *
 * @param base SPC peripheral base address.
 * @param voltageLevel Specify the DCDC_CORE Regulator voltage level, please refer to @ref spc_dcdc_voltage_level_t.
 */
static inline void SPC_SetLowPowerModeDCDCRegulatorVoltageLevel(SPC_Type *base, spc_dcdc_voltage_level_t voltageLevel)
{
    base->LP_CFG = (base->LP_CFG & (~SPC_LP_CFG_DCDC_VDD_LVL_MASK)) | SPC_LP_CFG_DCDC_VDD_LVL(voltageLevel);
    (void)SPC_SetLowPowerModeDCDCRegulatorDriveStrength(base, kSPC_DCDC_LowDriveStrength);
    SPC_SetActiveModeDCDCRegulatorVoltageLevel(base, voltageLevel);
}

/*!
 * @brief Get DCDC_CORE Regulator voltage level in Low power mode.
 *
 * @param base SPC peripheral base address.
 * @return DCDC_CORE Regulator voltage level, please refer to @ref spc_dcdc_voltage_level_t.
 */
static inline spc_dcdc_voltage_level_t SPC_GetLowPowerModeDCDCRegulatorVoltageLevel(SPC_Type *base)
{
    return (spc_dcdc_voltage_level_t)((uint32_t)((base->LP_CFG & SPC_LP_CFG_DCDC_VDD_LVL_MASK) >>
                                                 SPC_LP_CFG_DCDC_VDD_LVL_SHIFT));
}

/*! @} */
#endif /* FSL_FEATURE_MCX_SPC_HAS_DCDC */

#if defined(__cplusplus)
}
#endif /* __cplusplus */

/*! @} */

#endif /* FSL_SPC_H_ */
